Revit 2027 API
TextElement.BaseDirection Property
 Direction of the base line of the text element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BaseDirection { get; }
Public ReadOnly Property BaseDirection As XYZ
	Get
public:
property XYZ^ BaseDirection {
	XYZ^ get ();
}
member BaseDirection : XYZ with get
Property Value
XYZ
Remarks
Base direction is always perpendicular to Up direction. Those two vectors together define the plane of the text.
See Also
Reference
TextElement Class
Autodesk.Revit.DB Namespace